BitNibble/atmega324/Proj_atmega324_1/atmega324/Libraria/src/atmega324_timer.c
/*************************************************************************
	ATMEGA 324 TIMER
Author:   <sergio.salazar.santos@gmail.com>
License:  GNU General Public License
Hardware: Atmega 324 at 8Mhz
Date:     04072025
*************************************************************************/
/*
** library
*/
#include "atmega324_timer.h"

/**** Procedure and Function declaration ****/
void TIMER_COUNTER0_compoutmodeA(uint8_t compoutmode);
void TIMER_COUNTER0_compoutmodeB(uint8_t compoutmode);
void TIMER_COUNTER0_compareA(uint8_t compare);
void TIMER_COUNTER0_compareB(uint8_t compare);
void TIMER_COUNTER0_start(uint16_t prescaler);
void TIMER_COUNTER0_stop(void);
/******/
void TIMER_COUNTER1_compoutmodeA(uint8_t compoutmode);
void TIMER_COUNTER1_compoutmodeB(uint8_t compoutmode);
void TIMER_COUNTER1_compareA(uint16_t compare);
void TIMER_COUNTER1_compareB(uint16_t compare);
void TIMER_COUNTER1_start(uint16_t prescaler);
void TIMER_COUNTER1_stop(void);
/******/
void TIMER_COUNTER2_compoutmodeA(uint8_t compoutmode);
void TIMER_COUNTER2_compoutmodeB(uint8_t compoutmode);
void TIMER_COUNTER2_compareA(uint8_t compare);
void TIMER_COUNTER2_compareB(uint8_t compare);
void TIMER_COUNTER2_start(uint16_t prescaler);
void TIMER_COUNTER2_stop(void);
/******/
void TIMER_COUNTER3_compoutmodeA(uint8_t compoutmode);
void TIMER_COUNTER3_compoutmodeB(uint8_t compoutmode);
void TIMER_COUNTER3_compareA(uint16_t compare);
void TIMER_COUNTER3_compareB(uint16_t compare);
void TIMER_COUNTER3_start(uint16_t prescaler);
void TIMER_COUNTER3_stop(void);

static TIMER_COUNTER0 timer0_setup = {
	.compoutmodeA=TIMER_COUNTER0_compoutmodeA,
	.compoutmodeB=TIMER_COUNTER0_compoutmodeB,
	.compareA=TIMER_COUNTER0_compareA,
	.compareB=TIMER_COUNTER0_compareB,
	.start=TIMER_COUNTER0_start,
	.stop=TIMER_COUNTER0_stop
};
static uint8_t timer0_state;
static TIMER_COUNTER1 timer1_setup = {
	.compoutmodeA=TIMER_COUNTER1_compoutmodeA,
	.compoutmodeB=TIMER_COUNTER1_compoutmodeB,
	.compareA=TIMER_COUNTER1_compareA,
	.compareB=TIMER_COUNTER1_compareB,
	.start=TIMER_COUNTER1_start,
	.stop=TIMER_COUNTER1_stop
};
static uint8_t timer1_state;
static TIMER_COUNTER2 timer2_setup = {
	.compoutmodeA=TIMER_COUNTER2_compoutmodeA,
	.compoutmodeB=TIMER_COUNTER2_compoutmodeB,
	.compareA=TIMER_COUNTER2_compareA,
	.compareB=TIMER_COUNTER2_compareB,
	.start=TIMER_COUNTER2_start,
	.stop=TIMER_COUNTER2_stop
};
static uint8_t timer2_state;
static TIMER_COUNTER3 timer3_setup = {
	.compoutmodeA=TIMER_COUNTER3_compoutmodeA,
	.compoutmodeB=TIMER_COUNTER3_compoutmodeB,
	.compareA=TIMER_COUNTER3_compareA,
	.compareB=TIMER_COUNTER3_compareB,
	.start=TIMER_COUNTER3_start,
	.stop=TIMER_COUNTER3_stop
};
static uint8_t timer3_state;

/**** Handler ****/
void tc0_enable(uint8_t wavegenmode, uint8_t interrupt)
{
	timer0_state=0;
	
	tc0_reg()->ocr0a->var = 0XFF;
	tc0_reg()->ocr0b->var = 0XFF;
	tc0_reg()->tccr0a->var &= ~((1<<WGM00) | (1<<WGM01));
	tc0_reg()->tccr0b->var &= ~(1<<WGM02);
	switch(wavegenmode){
		case 1: // PWM, Phase Correct
			// TOP = 0xFF
			tc0_reg()->tccr0a->var|=(1<<WGM00);
			break;
		case 2: // CTC
			// TOP = OCRA
			tc0_reg()->tccr0a->var|=(1<<WGM01);
			break;
		case 3: // Fast PWM
			// TOP = 0xFF
			tc0_reg()->tccr0a->var|=((1<<WGM01) | (1<<WGM00));
			break;
		case 5: // PWM, Phase Correct
			// TOP = OCRA
			tc0_reg()->tccr0a->var|=((1<<WGM02) | (1<<WGM00));
			break;			
		case 7: // Fast PWM
			// TOP = OCRA
			tc0_reg()->tccr0a->var|=((1<<WGM02) | (1<<WGM01) | (1<<WGM00));
			break;				
		default: // Normal
			// TOP = 0xFF
			break;
	}
	tc0_reg()->timsk0->var &= ~((1<<OCIE0B) | (1<<OCIE0A) | (1<<TOIE0));
	switch(interrupt){
		case 1:
			tc0_reg()->timsk0->var|=(1<<TOIE0);
			cpu_reg()->sreg->par.i = 1;
			break;
		case 2:
			tc0_reg()->timsk0->var|=(1<<OCIE0A);
			cpu_reg()->sreg->par.i = 1;
			break;
		case 3:
			tc0_reg()->timsk0->var|=(1<<OCIE0B);
			cpu_reg()->sreg->par.i = 1;
			break;
		case 4:
			tc0_reg()->timsk0->var|=((1<<OCIE0A) | (1<<OCIE0B));
			cpu_reg()->sreg->par.i = 1;
			break;
		case 5:
			tc0_reg()->timsk0->var|=((1<<TOIE0) | (1<<OCIE0A) | (1<<OCIE0B));
			cpu_reg()->sreg->par.i = 1;
			break;
		case 6:
			tc0_reg()->timsk0->var|=((1<<TOIE0) | (1<<OCIE0A));
			cpu_reg()->sreg->par.i = 1;
			break;
		case 7:
			tc0_reg()->timsk0->var|=((1<<TOIE0) | (1<<OCIE0B));
			cpu_reg()->sreg->par.i = 1;
			break;
		default:
			break;
	}
}

TIMER_COUNTER0* tc0(void){ return &timer0_setup; }

/**** Procedure and Function definition ****/
void TIMER_COUNTER0_start(uint16_t prescaler)
{
	uint8_t timer0_prescaler;
	tc0_reg()->tccr0b->var &= ~((1<<CS02) | (1<<CS01) | (1<<CS00));
	if(timer0_state==0){
		tc0_reg()->tcnt0->var=0X00;
		switch(prescaler){
			case 0: // No clock source (Timer/Counter stopped).
			timer0_prescaler = 0x00;
			break;
			case 1: // clk T0S /(No prescaler)
			timer0_prescaler=(1<<CS00);
			break;
			case 8: // clk T0S /8 (From prescaler)
			timer0_prescaler=(1<<CS01);
			break;
			case 64: // clk T0S /64 (From prescaler)
			timer0_prescaler=((1<<CS01) | (1<<CS00));
			break;
			case 256: // clk T 0 S /256 (From prescaler)
			timer0_prescaler=(1<<CS02);
			break;
			case 1024: // clk T 0 S /1024 (From prescaler)
			timer0_prescaler=((1<<CS02) | (1<<CS00));
			break;
			case 6: // External clock source on T0 pin. Clock on falling edge.
			timer0_prescaler=((1<<CS02) | (1<<CS01));
			break;
			case 7: // External clock source on T0 pin. Clock on rising edge.
			timer0_prescaler=((1<<CS02) | (1<<CS01) | (1<<CS00));
			break;
			default: // clk T 0 S /1024 (From prescaler)
			timer0_prescaler=((1<<CS02) | (1<<CS00));
			break;
		}
		tc0_reg()->tccr0b->var|=timer0_prescaler;
		timer0_state=1;
	}
}
void TIMER_COUNTER0_compoutmodeA(uint8_t compoutmode)
{
	tc0_reg()->tccr0a->var&=~((1<<COM0A1) | (1<<COM0A0));
	switch(compoutmode){
		case 1:
		/***Compare Output mode, non-PWM mode.***/
		// Toggle OC0A on compare match
		/*** Compare Output mode, Fast PWM mode. ***/
		// WGM02 = 0: Normal Port Operation, OC0A Disconnected.
		// WGM02 = 1: Toggle OC0A on Compare Match.
		/*** Compare Output mode, Phase Correct PWM mode. ***/
		// WGM02 = 0: Normal Port Operation, OC0A Disconnected.
		// WGM02 = 1: Toggle OC0A on Compare Match.
		gpiob_reg()->ddr->par.bit3 = 1;
		tc0_reg()->tccr0a->var|=(1<<COM0A0);
		break;
		case 2:
		/***Compare Output mode, non-PWM mode.***/
		// Clear OC0A on compare match
		/*** Compare Output mode, Fast PWM mode. ***/
		// Clear OC0A on Compare Match, set OC0A at BOTTOM, (non-inverting mode).
		/*** Compare Output mode, Phase Correct PWM mode. ***/
		// Clear OC0A on Compare Match when up-counting. Set OC0A on Compare Match when down-counting.
		gpiob_reg()->ddr->par.bit3 = 1;
		tc0_reg()->tccr0a->var|=(1<<COM0A1);
		break;
		case 3:
		/***Compare Output mode, non-PWM mode.***/
		// Set OC0A on compare match
		/*** Compare Output mode, Fast PWM mode. ***/
		// Set OC0A on Compare Match, clear OC0A at BOTTOM, (inverting mode).
		/*** Compare Output mode, Phase Correct PWM mode. ***/
		// Set OC0A on Compare Match when up-counting. Clear OC0A on Compare Match when down-counting.
		gpiob_reg()->ddr->par.bit3 = 1;
		tc0_reg()->tccr0a->var|=((1<<COM0A0) | (1<<COM0A1));
		break;
		default:
		/***Compare Output mode, non-PWM mode.***/
		// Normal port operation, OC0A disconnected
		/*** Compare Output mode, Fast PWM mode. ***/
		// Normal port operation, OC0A disconnected
		/*** Compare Output mode, Phase Correct PWM mode. ***/
		// Normal port operation, OC0A disconnected
		break;
	}
}
void TIMER_COUNTER0_compoutmodeB(uint8_t compoutmode)
{
	tc0_reg()->tccr0a->var&=~((1<<COM0B1) | (1<<COM0B0));
	switch(compoutmode){
		case 1:
		/*** Compare Output mode, non-PWM mode. ***/
		// Toggle OC0B on Compare Match
		/*** Compare Output mode, Fast PWM mode. ***/
		// Reserved
		/*** Compare Output mode, Phase Correct PWM mode ***/
		// Reserved
		gpiob_reg()->ddr->par.bit4 = 1;
		tc0_reg()->tccr0a->var|=(1<<COM0B0);
		break;
		case 2:
		/*** Compare Output mode, non-PWM mode. ***/
		// Clear OC0B on Compare Match
		/*** Compare Output mode, Fast PWM mode. ***/
		// Clear OC0B on Compare Match, set OC0B at BOTTOM, (non-inverting mode).
		/*** Compare Output mode, Phase Correct PWM mode ***/
		// Clear OC0B on Compare Match when up-counting. Set OC0B on Compare Match when down-counting.
		gpiob_reg()->ddr->par.bit4 = 1;
		tc0_reg()->tccr0a->var|=(1<<COM0B1);
		break;
		case 3:
		/*** Compare Output mode, non-PWM mode. ***/
		// Set OC0B on Compare Match
		/*** Compare Output mode, Fast PWM mode. ***/
		// Set OC0B on Compare Match, clear OC0B at BOTTOM, (inverting mode).
		/*** Compare Output mode, Phase Correct PWM mode ***/
		// Set OC0B on Compare Match when up-counting. Clear OC0B on Compare Match when down-counting.
		gpiob_reg()->ddr->par.bit4 = 1;
		tc0_reg()->tccr0a->var|=((1<<COM0B0) | (1<<COM0B1));
		break;
		default:
		/*** Compare Output mode, non-PWM mode. ***/
		// Normal port operation, OC0B disconnected.
		/*** Compare Output mode, Fast PWM mode. ***/
		// Normal port operation, OC0B disconnected.
		/*** Compare Output mode, Phase Correct PWM mode ***/
		// Normal port operation, OC0B disconnected.
		break;
	}
}
void TIMER_COUNTER0_compareA(uint8_t compare)
{
	tc0_reg()->ocr0a->var=compare;
}
void TIMER_COUNTER0_compareB(uint8_t compare)
{
	tc0_reg()->ocr0b->var=compare;
}
void TIMER_COUNTER0_stop(void)
{
	tc0_reg()->tccr0b->var&=~((1<<CS02) | (1<<CS01) | (1<<CS00));
	timer0_state=0;
}

/***** Handler *****/
void tc1_enable(uint8_t wavegenmode, uint8_t interrupt)
{
	timer1_state=0;
	
