BitNibble/atmega324/Proj_atmega324_1/atmega324/Libraria/src/atmega324_timer.c
	tc1_reg()->ocr1a->var = 0XFFFF;
	tc1_reg()->ocr1b->var = 0XFFFF;
	tc1_reg()->tccr1a->var &= ~((1<<WGM11) | (1<<WGM10));
	tc1_reg()->tccr1b->var &= ~((1<<WGM13) | (1<<WGM12));
	
	switch(wavegenmode){
		case 1: // PWM, Phase Correct, 8-bit
			// TOP = 0x00FF
			tc1_reg()->tccr1a->var|=(1<<WGM10);
			break;
		case 2:	// PWM, Phase Correct, 9-bit
			// TOP = 0x01FF
			tc1_reg()->tccr1a->var|=(1<<WGM11);
			break;
		case 3:	// PWM, Phase Correct, 10-bit
			// TOP = 0x3FF
			tc1_reg()->tccr1a->var|=((1<<WGM11) | (1<<WGM10));
			break;
		case 4:	// CTC
			// TOP = OCR1A
			tc1_reg()->tccr1b->var|=(1<<WGM12);
			break;
		case 5:	// Fast PWM, 8-bit
			// TOP = 0x00FF
			tc1_reg()->tccr1a->var|=(1<<WGM10);
			tc1_reg()->tccr1b->var|=(1<<WGM12);
			break;
		case 6:	// Fast PWM, 9-bit
			// TOP = 0x1FF
			tc1_reg()->tccr1a->var|=(1<<WGM11);
			tc1_reg()->tccr1b->var|=(1<<WGM12);
			break;
		case 7:	// Fast PWM, 10-bit
			// TOP = 0x3FF
			tc1_reg()->tccr1a->var|=((1<<WGM11) | (1<<WGM10));
			tc1_reg()->tccr1b->var|=(1<<WGM12);
			break;
		case 8:	// PWM, Phase and Frequency Correct
			// TOP = ICR1
			tc1_reg()->tccr1b->var|=(1<<WGM13);
			break;
		case 9:	// PWM, Phase and Frequency Correct
			// TOP = OCR1A
			tc1_reg()->tccr1c->var&=~((1<<FOC1A) | (1<<FOC1B));
			tc1_reg()->tccr1a->var|=(1<<WGM10);
			tc1_reg()->tccr1b->var|=(1<<WGM13);
			break;
		case 10: // PWM, Phase Correct
			// TOP = ICR1
			tc1_reg()->tccr1a->var|=(1<<WGM11);
			tc1_reg()->tccr1b->var|=(1<<WGM13);
			break;
		case 11: // PWM, Phase Correct
			// TOP = OCR1A
			tc1_reg()->tccr1c->var&=~((1<<FOC1A) | (1<<FOC1B));
			tc1_reg()->tccr1a->var|=((1<<WGM11) | (1<<WGM10));
			tc1_reg()->tccr1b->var|=(1<<WGM13);
			break;
		case 12: // CTC
			// TOP = ICR1
			tc1_reg()->tccr1b->var|=((1<<WGM13) | (1<<WGM12));
			break;
		case 14: // Fast PWM
			// TOP = ICR1
			tc1_reg()->tccr1a->var|=(1<<WGM11);
			tc1_reg()->tccr1b->var|=((1<<WGM13) | (1<<WGM12));
			break;
		case 15: // Fast PWM
			// TOP = OCR1A
			tc1_reg()->tccr1c->var&=~((1<<FOC1A) | (1<<FOC1B));
			tc1_reg()->tccr1a->var|=((1<<WGM11) | (1<<WGM10));
			tc1_reg()->tccr1b->var|=((1<<WGM13) | (1<<WGM12));
			break;
		default: // Normal
			// TOP = 0xFFFF
			break;
	}
	tc1_reg()->timsk1->var&=~((1<<ICIE1) | (1<<OCIE1A) | (1<<OCIE1B) | (1<<TOIE1));
	switch(interrupt){
		case 1:
			tc1_reg()->timsk1->var|=(1<<TOIE1);
			cpu_reg()->sreg->par.i = 1;
			break;
		case 2:
			tc1_reg()->timsk1->var|=(1<<OCIE1B);
			cpu_reg()->sreg->par.i = 1;
			break;
		case 3:
			tc1_reg()->timsk1->var|=(1<<OCIE1A);
			cpu_reg()->sreg->par.i = 1;
		break;
			case 4:
			tc1_reg()->timsk1->var|=(1<<ICIE1);
			cpu_reg()->sreg->par.i = 1;
		break;
			case 6:
			tc1_reg()->timsk1->var|=((1<<OCIE1B) | (1<<TOIE1));
			cpu_reg()->sreg->par.i = 1;
			break;
		case 7:
			tc1_reg()->timsk1->var|=((1<<OCIE1A) | (1<<TOIE1));
			cpu_reg()->sreg->par.i = 1;
			break;
		case 8:
			tc1_reg()->timsk1->var|=((1<<OCIE1A) | (1<<OCIE1B));
			cpu_reg()->sreg->par.i = 1;
			break;
		case 9:
			tc1_reg()->timsk1->var|=((1<<OCIE1A) | (1<<OCIE1B) | (1<<TOIE1));
			cpu_reg()->sreg->par.i = 1;
			break;
		default:
			break;
	}
}

TIMER_COUNTER1* tc1(void){ return &timer1_setup; }

/**** Procedure and Function definition ****/
void TIMER_COUNTER1_start(uint16_t prescaler)
{
	uint8_t timer1_prescaler;
	tc1_reg()->tccr1b->var &= ~((1<<CS12) | (1<<CS11) | (1<<CS10));
	if(timer1_state==0){
		tc1_reg()->tcnt1->var=0X0000;
		switch(prescaler){
			case 0: // No clock source (Timer/Counter stopped).
				timer1_prescaler=0x0000; 
			case 1: // clkI/O/1 (No prescaling)
				timer1_prescaler=(1<<CS10);
				break;
			case 8: // clkI/O/8 (From prescaler)
				timer1_prescaler=(1<<CS11);
				break;
			case 64: // clkI/O/64 (From prescaler)
				timer1_prescaler=((1<<CS11) | (1<<CS10));
				break;
			case 256: // clkI/O/256 (From prescaler)
				timer1_prescaler=(1<<CS12);
				break;
			case 1024: // clkI/O/1024 (From prescaler)
				timer1_prescaler=((1<<CS12) | (1<<CS10));
				break;
			case 6: // External clock source on Tn pin. Clock on falling edge
				timer1_prescaler=((1<<CS12) | (1<<CS11));
				break;
			case 7: // External clock source on Tn pin. Clock on rising edge
				timer1_prescaler=((1<<CS12) | (1<<CS11) | (7<<CS10));
				break;
			default:
				timer1_prescaler=((1<<CS12) | (1<<CS10));
				break;
		}
		tc1_reg()->tccr1b->var|=timer1_prescaler;
		timer1_state=1;
	}
}
void TIMER_COUNTER1_compoutmodeA(uint8_t compoutmode)
{
	tc1_reg()->tccr1a->var&=~((1<<COM1A1) | (1<<COM1A0));
	switch(compoutmode){
		case 1:
			/*** Compare Output mode, non-PWM. ***/
			// Toggle OCnA/OCnB on Compare Match.
			/*** Compare Output mode, fast PWM ***/
			// WGMn3:0 = 14 or 15: Toggle OC1A on Compare Match, OC1B disconnected (normal port operation).
			// For all other WGM1 settings, normal port operation, OC1A/OC1B disconnected.
			/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/
			// WGMn3:0 = 9 or 11: Toggle OCnA on Compare Match, OCnB disconnected (normal port operation).
			// For all other WGM1 settings, normal port operation, OC1A/OC1B disconnected.
			gpiod_reg()->ddr->par.bit5 = 1;
			tc1_reg()->tccr1a->var|=(1<<COM1A0);
			break;
		case 2:
			/*** Compare Output mode, non-PWM. ***/
			// Clear OCnA/OCnB on Compare Match (Set output to low level).
			/*** Compare Output mode, fast PWM ***/
			// Clear OCnA/OCnB on Compare Match, set OCnA/OCnB at BOTTOM (non-inverting mode)
			/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/
			// Clear OCnA/OCnB on Compare Match when up-counting.
			// Set OCnA/OCnB on Compare Match when down counting.
			gpiod_reg()->ddr->par.bit5 = 1;
			tc1_reg()->tccr1a->var|=(1<<COM1A1);
			break;
		case 3:
			/*** Compare Output mode, non-PWM. ***/
			// Set OCnA/OCnB on Compare Match (Set output to high level).
			/*** Compare Output mode, fast PWM ***/
			// Set OCnA/OCnB on Compare Match, clear OCnA/OCnB at BOTTOM (inverting mode)
			/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/
			// Set OCnA/OCnB on Compare Match when up-counting.
			// Clear OCnA/OCnB on Compare Match when down counting.
			gpiod_reg()->ddr->par.bit5 = 1;
			tc1_reg()->tccr1a->var|=((1<<COM1A0) | (1<<COM1A1));
			break;
		default:
			/*** Compare Output mode, non-PWM. ***/
			// Normal port operation, OCnA/OCnB disconnected.
			/*** Compare Output mode, fast PWM ***/
			// Normal port operation, OCnA/OCnB disconnected.
			/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/ 
			// Normal port operation, OCnA/OCnB disconnected.
			break;
	}
}
void TIMER_COUNTER1_compoutmodeB(uint8_t compoutmode)
{
	tc1_reg()->tccr1a->var&=~((1<<COM1B1) | (1<<COM1B0));
	switch(compoutmode){
		case 1:
		/*** Compare Output mode, non-PWM. ***/
		// Toggle OCnA/OCnB on Compare Match.
		/*** Compare Output mode, fast PWM ***/
		// WGMn3:0 = 14 or 15: Toggle OC1A on Compare Match, OC1B disconnected (normal port operation).
		// For all other WGM1 settings, normal port operation, OC1A/OC1B disconnected.
		/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/
		// WGMn3:0 = 9 or 11: Toggle OCnA on Compare Match, OCnB disconnected (normal port operation).
		// For all other WGM1 settings, normal port operation, OC1A/OC1B disconnected.
		gpiod_reg()->ddr->par.bit4 = 1;
		tc1_reg()->tccr1a->var|=(1<<COM1B0);
		break;
		case 2:
		/*** Compare Output mode, non-PWM. ***/
		// Clear OCnA/OCnB on Compare Match (Set output to low level).
		/*** Compare Output mode, fast PWM ***/
		// Clear OCnA/OCnB on Compare Match, set OCnA/OCnB at BOTTOM (non-inverting mode)
		/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/
		// Clear OCnA/OCnB on Compare Match when up-counting.
		// Set OCnA/OCnB on Compare Match when down counting.
		gpiod_reg()->ddr->par.bit4 = 1;
		tc1_reg()->tccr1a->var|=(1<<COM1B1);
		break;
		case 3:
		/*** Compare Output mode, non-PWM. ***/
		// Set OCnA/OCnB on Compare Match (Set output to high level).
		/*** Compare Output mode, fast PWM ***/
		// Set OCnA/OCnB on Compare Match, clear OCnA/OCnB at BOTTOM (inverting mode)
		/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/
		// Set OCnA/OCnB on Compare Match when up-counting.
		// Clear OCnA/OCnB on Compare Match when down counting.
		gpiod_reg()->ddr->par.bit4 = 1;
		tc1_reg()->tccr1a->var|=((1<<COM1B0) | (1<<COM1B1));
		break;
		default:
		/*** Compare Output mode, non-PWM. ***/
		// Normal port operation, OCnA/OCnB disconnected.
		/*** Compare Output mode, fast PWM ***/
		// Normal port operation, OCnA/OCnB disconnected.
		/*** Compare Output mode, phase correct and phase and frequency correct PWM. ***/
		// Normal port operation, OCnA/OCnB disconnected.
		break;
	}
}
void TIMER_COUNTER1_compareA(uint16_t compare)
{
	tc1_reg()->ocr1a->var=compare;
}
void TIMER_COUNTER1_compareB(uint16_t compare)
{
	tc1_reg()->ocr1b->var=compare;
}
void TIMER_COUNTER1_stop(void)
{
	tc1_reg()->tccr1b->var&=~((1<<CS12) | (1<<CS11) | (1<<CS10));
	timer1_state=0;
}

